{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_filter": 32, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "output_dim": 512, "input_dim": 7200, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "output_dim": 64, "input_dim": 512, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_constraint": null, "output_dim": 1, "input_dim": 64, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "tanh"}}]}